start_message = (
    "Здравствуйте, {0.first_name}! Я бот для торгового "
    "дома Агропрод, Выберите действие:")
select_category_message = "Выберите категорию мяса:"
answer_to_question_msg = (
    "Благодарим за вопрос. Он был передан"
    " нашим коллегам, они свяжутся с вами в ближайшее время.")
boneless_beef_message = (
    "Выберите конкретный товар, чтобы посмотреть его описание:")
beef_description_message = "<b>{}</b>\nЦена (руб.) за кг: <b>{}</b>\nГОСТ: {}"
choice_action_message = "Выберите действие:"
back_message = "Вы вернулись в начало.\nВыберите действие:"
enter_question_message = "Пожалуйста, введите свой вопрос:"
data_not_found_massage = "Данные не найдены."
enter_name_message = "Введите ваше имя:"
enter_phone_number_message = ("Введите ваш номер телефона\nВ "
                              "формате +7 000-000-00-00.")
error_name_message = ("Ваше имя не может состоять всего из одной буквы, "
                      "пожалуйста, введите ваше имя еще раз.")
error_phone_message = (
    "Неверный формат номера телефона.\nВведите номер в "
    "формате +7 000-000-00-00.")
enter_address_message = (
    "Введите адрес доставки, где вам будет удобнее"
    " принять товар.\nПомните, что мы доставляем только по Алтайскому краю.")
select_product_order_message = "Выберите конкретный товар для заказа:"
error_ordering_message = (
    "Ошибка при оформлении заказа.\nПожалуйста, "
    "попробуйте еще раз.")
error_date_message = (
    "Пожалуйста, введите корректную дату в "
    "формате ГГГГ-ММ-ДД и убедитесь, что она больше текущей.")
successfully_order_message = "Ваш заказ успешно оформлен!"
order_text_message = (
    "Ваш заказ:\n"
    "Имя: {name}\n"
    "Номер телефона: {phone_number}\n"
    "Адрес доставки: {address}\n"
    "Товар: {name_beef}\n"
    "Количество: {quantity} кг\n"
    "Дата доставки: {date}"
)
enter_date_message = "Введите дату доставки (в формате ГГГГ-ММ-ДД):"
error_quantity_message = "Пожалуйста, введите корректное число от 1 до 200."
enter_quantity_message = "Теперь введите колличество мяса в кг (от 1 до 200):"
error_order_type = "Ошибка: Неизвестный тип заказа."
